org/reference/investment.org
:PROPERTIES:
:ID:       f8027182-bf9a-4649-82f9-bcf3a80469f5
:END:
#+title: Investment

* Investing In ETFs
:PROPERTIES:
:ID:       b37ead31-5908-4a42-9e77-8343d8d0ae35
:END:

** Identifying good ETFs /(Joshua Giersch, Rich By Retirement)/

Good ETFs satisfy the following conditions:

1. Low fees (<0.3% per annum)
2. Plenty of assets in the fund (above $100 million)
3. "Cash" or "physical", not "synthetic"
   1. This is because if the counterparty collapses, the synthetic ETF
      will start tracking the bunch of miscellaneous stocks

* Portfolio Composition
:PROPERTIES:
:ID:       1c59a56f-d466-462d-b309-9964addfa081
:END:

** General recommendations

1. Invest in ETFs, not single stocks ([[id:b37ead31-5908-4a42-9e77-8343d8d0ae35][Investing In ETFs]])
2. Invest "110 minus your age" into stocks, and the rest into bonds
3. For the stock component, half should be in local-stock ETF and half
   in global stock ETF
   1. Global stock ETF is inherently more volatile, affected by
      currency
4. The bond component should be entirely local

** Good ETFs
- SPDR Straits Times Index ETF: ES3
  - big, liquid, 0.3% expense ratio
- MBH, Nikko Asset Management SGD Investment-Grade Corporate Bond ETF
- IWDA, the iShares Core MSCI World ETF
  - invests in every developed market in the world, 0.2% expense ratio
