content/posts/investment.md
+++
title = "Investment"
author = ["Jethro Kuan"]
draft = false
+++

## Investing In ETFs {#investing-in-etfs}


### Identifying good ETFs _(Joshua Giersch, Rich By Retirement)_ {#identifying-good-etfs--joshua-giersch-rich-by-retirement}

Good ETFs satisfy the following conditions:

1.  Low fees (<0.3% per annum)
2.  Plenty of assets in the fund (above $100 million)
3.  "Cash" or "physical", not "synthetic"
    1.  This is because if the counterparty collapses, the synthetic ETF
        will start tracking the bunch of miscellaneous stocks


## Portfolio Composition {#portfolio-composition}


### General recommendations {#general-recommendations}

1.  Invest in ETFs, not single stocks ([Investing In ETFs](#investing-in-etfs))
2.  Invest "110 minus your age" into stocks, and the rest into bonds
3.  For the stock component, half should be in local-stock ETF and half
    in global stock ETF
    1.  Global stock ETF is inherently more volatile, affected by
        currency
4.  The bond component should be entirely local


### Good ETFs {#good-etfs}

-   SPDR Straits Times Index ETF: ES3
    -   big, liquid, 0.3% expense ratio
-   MBH, Nikko Asset Management SGD Investment-Grade Corporate Bond ETF
-   IWDA, the iShares Core MSCI World ETF
    -   invests in every developed market in the world, 0.2% expense ratio